## Plan Result (sbox_mgmt - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 27 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_eventhub.evh-bl-dl-dev
  * azurerm_eventhub.evh-bl-pub-dev
  * azurerm_eventhub.evh-joh-dl-dev
  * azurerm_eventhub.evh-joh-pub-dev
  * azurerm_eventhub.evh-td-dl-dev
  * azurerm_eventhub.evh-td-pub-dev
  * azurerm_eventhub.evh_apl_ack_dev
  * azurerm_eventhub.evh_apl_dl_dev
  * azurerm_eventhub.evh_apl_pub_dev
  * azurerm_eventhub.evh_bl_ack_dev
  * azurerm_eventhub_authorization_rule.evh_apl_dl_dev_uks_dlrm_01_manager
  * azurerm_eventhub_authorization_rule.evh_bl_ack_dev_uks_dlrm_01_ariabailsack
  * azurerm_eventhub_authorization_rule.evh_bl_dl_dev_uks_dlrm_01_evh_bl_dl_dev_uks_dlrm_01
  * azurerm_eventhub_authorization_rule.evh_bl_pub_dev_uks_dlrm_01_aria_bails
  * azurerm_eventhub_authorization_rule.evh_joh_dl_dev_uks_dlrm_01_joh_deadletterque
  * azurerm_eventhub_authorization_rule.evh_joh_pub_dev_adls_account_key
  * azurerm_eventhub_authorization_rule.evh_td_dl_dev_uks_dlrm_01_test_dl
  * azurerm_eventhub_authorization_rule.evh_td_pub_dev_uks_dlrm_01_test_nsa
  * azurerm_eventhub_consumer_group.evh_apl_dl_dev_test
  * azurerm_eventhub_consumer_group.evh_apl_pub_dev_preview
  * azurerm_eventhub_consumer_group.evh_joh_pub_dev_preview
  * azurerm_eventhub_consumer_group.evh_td_dl_dev_test
  * azurerm_eventhub_consumer_group.evh_td_pub_dev_preview
  * azurerm_eventhub_namespace.sbox-dlrm-eventhub-ns
  * azurerm_eventhub_namespace_authorization_rule.dlrm_eventhub_namespace_sender
  * azurerm_eventhub_namespace_authorization_rule.root_manage_shared_access_key
* Replace
  * module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventhub.evh-bl-dl-dev will be created
  + resource "azurerm_eventhub" "evh-bl-dl-dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 8
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh-bl-pub-dev will be created
  + resource "azurerm_eventhub" "evh-bl-pub-dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh-joh-dl-dev will be created
  + resource "azurerm_eventhub" "evh-joh-dl-dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh-joh-pub-dev will be created
  + resource "azurerm_eventhub" "evh-joh-pub-dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-joh-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh-td-dl-dev will be created
  + resource "azurerm_eventhub" "evh-td-dl-dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh-td-pub-dev will be created
  + resource "azurerm_eventhub" "evh-td-pub-dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-td-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh_apl_ack_dev will be created
  + resource "azurerm_eventhub" "evh_apl_ack_dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-ack-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh_apl_dl_dev will be created
  + resource "azurerm_eventhub" "evh_apl_dl_dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-dl-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 1
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh_apl_pub_dev will be created
  + resource "azurerm_eventhub" "evh_apl_pub_dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apl-pub-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 18
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub.evh_bl_ack_dev will be created
  + resource "azurerm_eventhub" "evh_bl_ack_dev" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-bl-ack-dev-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = (known after apply)
      + partition_count     = 10
      + partition_ids       = (known after apply)
      + resource_group_name = (known after apply)
      + status              = "Active"
    }

  # azurerm_eventhub_authorization_rule.evh_apl_dl_dev_uks_dlrm_01_manager will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_apl_dl_dev_uks_dlrm_01_manager" {
      + eventhub_name                     = "evh-apl-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "manager"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.evh_bl_ack_dev_uks_dlrm_01_ariabailsack will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_bl_ack_dev_uks_dlrm_01_ariabailsack" {
      + eventhub_name                     = "evh-bl-ack-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "ariabailsack"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.evh_bl_dl_dev_uks_dlrm_01_evh_bl_dl_dev_uks_dlrm_01 will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_bl_dl_dev_uks_dlrm_01_evh_bl_dl_dev_uks_dlrm_01" {
      + eventhub_name                     = "evh-bl-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "evh-bl-dl-dev-uks-dlrm-01"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.evh_bl_pub_dev_uks_dlrm_01_aria_bails will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_bl_pub_dev_uks_dlrm_01_aria_bails" {
      + eventhub_name                     = "evh-bl-pub-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "aria-bails"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.evh_joh_dl_dev_uks_dlrm_01_joh_deadletterque will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_joh_dl_dev_uks_dlrm_01_joh_deadletterque" {
      + eventhub_name                     = "evh-joh-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "JOH-deadletterque"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # azurerm_eventhub_authorization_rule.evh_joh_pub_dev_adls_account_key will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_joh_pub_dev_adls_account_key" {
      + eventhub_name                     = "evh-joh-pub-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "ADLSAccountKey"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.evh_td_dl_dev_uks_dlrm_01_test_dl will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_td_dl_dev_uks_dlrm_01_test_dl" {
      + eventhub_name                     = "evh-td-dl-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "test-dl"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_authorization_rule.evh_td_pub_dev_uks_dlrm_01_test_nsa will be created
  + resource "azurerm_eventhub_authorization_rule" "evh_td_pub_dev_uks_dlrm_01_test_nsa" {
      + eventhub_name                     = "evh-td-pub-dev-uks-dlrm-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "test-nsa"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_consumer_group.evh_apl_dl_dev_test will be created
  + resource "azurerm_eventhub_consumer_group" "evh_apl_dl_dev_test" {
      + eventhub_name       = "evh-apl-dl-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "test"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # azurerm_eventhub_consumer_group.evh_apl_pub_dev_preview will be created
  + resource "azurerm_eventhub_consumer_group" "evh_apl_pub_dev_preview" {
      + eventhub_name       = "evh-apl-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # azurerm_eventhub_consumer_group.evh_joh_pub_dev_preview will be created
  + resource "azurerm_eventhub_consumer_group" "evh_joh_pub_dev_preview" {
      + eventhub_name       = "evh-joh-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # azurerm_eventhub_consumer_group.evh_td_dl_dev_test will be created
  + resource "azurerm_eventhub_consumer_group" "evh_td_dl_dev_test" {
      + eventhub_name       = "evh-td-dl-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "test"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # azurerm_eventhub_consumer_group.evh_td_pub_dev_preview will be created
  + resource "azurerm_eventhub_consumer_group" "evh_td_pub_dev_preview" {
      + eventhub_name       = "evh-td-pub-dev-uks-dlrm-01"
      + id                  = (known after apply)
      + name                = "preview_data_consumer_group"
      + namespace_name      = "sbox-dlrm-eventhub-ns"
      + resource_group_name = "ingest-mgmt-rg-sbox"
    }

  # azurerm_eventhub_namespace.sbox-dlrm-eventhub-ns will be created
  + resource "azurerm_eventhub_namespace" "sbox-dlrm-eventhub-ns" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "uksouth"
      + maximum_throughput_units                  = 25
      + minimum_tls_version                       = "1.2"
      + name                                      = "sbox-dlrm-eventhub-ns"
      + network_rulesets                          = (known after apply)
      + public_network_access_enabled             = true
      + resource_group_name                       = "ingest-mgmt-rg-sbox"
      + sku                                       = "Premium"
      + tags                                      = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # azurerm_eventhub_namespace_authorization_rule.dlrm_eventhub_namespace_sender will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "dlrm_eventhub_namespace_sender" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "dlrm-eventhub-namespace-sender"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # azurerm_eventhub_namespace_authorization_rule.root_manage_shared_access_key will be created
  + resource "azurerm_eventhub_namespace_authorization_rule" "root_manage_shared_access_key" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = true
      + name                              = "RootManageSharedAccessKey"
      + namespace_name                    = "sbox-dlrm-eventhub-ns"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "ingest-mgmt-rg-sbox"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.data_mgmt_zone.azurerm_eventhub_namespace.eventhub-namespace must be replaced
-/+ resource "azurerm_eventhub_namespace" "eventhub-namespace" {
      ~ auto_inflate_enabled                      = true -> false
      ~ capacity                                  = 20 -> 25
      ~ default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      ~ default_primary_key                       = (sensitive value)
      ~ default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      ~ default_secondary_key                     = (sensitive value)
      ~ id                                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest-mgmt-rg-sbox/providers/Microsoft.EventHub/namespaces/sbox-dlrm-eventhub-ns" -> (known after apply)
      - maximum_throughput_units                  = 25 -> null
        name                                      = "sbox-dlrm-eventhub-ns"
      ~ network_rulesets                          = [
          - {
              - default_action                 = "Allow"
              - ip_rule                        = []
              - public_network_access_enabled  = true
              - trusted_service_access_enabled = false
              - virtual_network_rule           = []
            },
        ] -> (known after apply)
      ~ sku                                       = "Standard" -> "Premium" # forces replacement
        tags                                      = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 27 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":61,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt - TerraformPlanApply","Vars":{}} -->